
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	// 1. Получение платежной ссылки
	
	// 2. Получение короткой ссылки
	
	ДлиннаяСсылка = "https://ironskills.by/tpost/9n6shepvf1-sklonenie-po-padezham-v-1s";
	ДанныеСсылки = РаботаССервисами.ПолучитьКороткуюСсылку(ДлиннаяСсылка);
	КороткаяСсылка = ДанныеСсылки.КороткаяСсылка;
	Если ДанныеСсылки.QR <> Неопределено Тогда
		ДанныеКартинки = ДанныеСсылки.QR;
		АдресКартинкиQR = ПоместитьВоВременноеХранилище(ДанныеКартинки);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьВTelegramНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.ИдЧата КАК ИдЧата
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ИдЧата = Выборка.ИдЧата;
		Если ЗначениеЗаполнено(ИдЧата) Тогда
			Текст = "Дорогой, друг! Ссылка для оплаты: " + КороткаяСсылка;
			СообщениеОтправлено = РаботаССервисами.ОтправитьСообщениеВTelegram(ИдЧата, Текст);
			Если СообщениеОтправлено Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ссылка отправлена";
				Сообщение.Сообщить();			
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВTelegram(Команда)
	ОтправитьВTelegramНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Контрагент = Параметры.Контрагент;
	
КонецПроцедуры
